# Connect to the Database

In [1]:
%load_ext sql 

%config SqlMagic.displaylimit = 8

In [2]:
%sql postgresql://postgres:12345@localhost:5432/postgres

Connecting to 'postgresql://postgres:***@localhost:5432/postgres'

In [3]:
%sql SELECT version()

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------------------------------------------------------------------------+
|                                 version                                 |
+-------------------------------------------------------------------------+
| PostgreSQL 18.1 on x86_64-windows, compiled by msvc-19.44.35221, 64-bit |
+-------------------------------------------------------------------------+

In [4]:
# set search path
%sql SET search_path TO classicmodels, public

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

++
||
++
++

# Scalar Subqueries and Derived Tables Exercises

Practice exercises for scalar subqueries (single-row returns) and derived tables (subqueries in FROM clause).

## Part 1: Scalar Subqueries (Single Row Return)

### 1. Find products more expensive than the average product price
List productName, productLine, and buyPrice for products whose buyPrice is greater than the average buyPrice of all products.

**Hint:** Use a subquery that returns AVG(buyPrice)

In [5]:
%%sql

select productName, productline ,buyPrice
from products
where buyPrice > (select avg(buyPrice) 
                    from products)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

54 rows affected.

+--------------------------------------+------------------+----------+
|             productname              |   productline    | buyprice |
+--------------------------------------+------------------+----------+
|       1952 Alpine Renault 1300       |   Classic Cars   |  98.58   |
|        1996 Moto Guzzi 1100i         |   Motorcycles    |  68.99   |
| 2003 Harley-Davidson Eagle Drag Bike |   Motorcycles    |  91.02   |
|         1972 Alfa Romeo GTA          |   Classic Cars   |  85.68   |
|        1962 LanciaA Delta 16V        |   Classic Cars   |  103.42  |
|          1968 Ford Mustang           |   Classic Cars   |  95.34   |
|          2001 Ferrari Enzo           |   Classic Cars   |  95.59   |
|            1958 Setra Bus            | Trucks and Buses |   77.9   |
+--------------------------------------+------------------+----------+
Truncated to displaylimit of 8.

### 2. Find customers whose total payment amount exceeds the average customer payment
Display customerName and total payment amount for customers whose total payments are greater than the average total payment per customer.

**Hint:** Use a scalar subquery with AVG in the HAVING clause

In [7]:
%%sql

select c.customerNumber, c.customerName, sum(p.amount) as totalPayments
from customers c
join payments p on c.customerNumber = p.customerNumber
group by c.customerNumber, c.customerName
having sum(p.amount) > (select avg(customerPayments)
                        from (select sum(amount) as customerPayments
                                from payments
                                group by customerNumber) as avgPayments)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

33 rows affected.

+----------------+------------------------------+---------------+
| customernumber |         customername         | totalpayments |
+----------------+------------------------------+---------------+
|      146       |    Saveley & Henriot, Co.    |   130305.35   |
|      278       |        Rovelli Gifts         |   127529.69   |
|      276       |   Anna's Decorations, Ltd    |   137034.22   |
|      323       |  Down Under Souveniers, Inc  |   154622.08   |
|      320       |     Mini Creations Ltd.      |   101872.52   |
|      114       |  Australian Collectors, Co.  |   180585.07   |
|      124       | Mini Gifts Distributors Ltd. |   584188.24   |
|      282       |  Souveniers And Things Co.   |    91655.61   |
+----------------+------------------------------+---------------+
Truncated to displaylimit of 8.

### 3. Find the employee who reports to the president (employee with no manager)
List firstName, lastName, and jobTitle for the employee whose employeeNumber equals the reportsTo value that appears most frequently.

**Alternative:** Find employees who report to the employee with the highest employeeNumber

> พนักงานที่ไม่มีหัวหน้า (reportsTo IS NULL) → นี่คือ President

In [9]:
%%sql

SELECT firstName, lastName, jobTitle
FROM employees
WHERE reportsTo = (SELECT employeeNumber
                    FROM employees
                    WHERE reportsTo IS NULL);

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

2 rows affected.

+-----------+-----------+--------------+
| firstname |  lastname |   jobtitle   |
+-----------+-----------+--------------+
|    Mary   | Patterson |   VP Sales   |
|    Jeff   |  Firrelli | VP Marketing |
+-----------+-----------+--------------+

## Part 2: Derived Tables (Subqueries in FROM Clause)

### 4. Find the top 3 customers by total order value
Use a subquery in FROM clause to calculate total order value per customer (sum of quantityOrdered * priceEach from orderdetails). Then select customerName and totalOrderValue, ordered by value DESC, limit 3.

**Hint:** Join the derived table with customers table

In [10]:
%%sql

SELECT c.customerName, orderValues.totalValue
FROM customers c
JOIN (SELECT o.customerNumber,SUM(od.quantityOrdered * od.priceEach) AS totalValue
        FROM orders o
        JOIN orderdetails od ON o.orderNumber = od.orderNumber
        GROUP BY o.customerNumber) AS orderValues 
ON c.customerNumber = orderValues.customerNumber
ORDER BY orderValues.totalValue DESC
LIMIT 3;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

3 rows affected.

+------------------------------+------------+
|         customername         | totalvalue |
+------------------------------+------------+
|    Euro+ Shopping Channel    | 820689.54  |
| Mini Gifts Distributors Ltd. | 591827.34  |
|  Australian Collectors, Co.  | 180585.07  |
+------------------------------+------------+

### 5. Find product lines with average product price above $50
Create a derived table that calculates AVG(buyPrice) per productLine. Then select productLine and avgPrice where avgPrice > 50.

**Hint:** Use the subquery in FROM clause

In [11]:
%%sql

SELECT productLine, avgPrice
FROM (SELECT productLine, AVG(buyPrice) AS avgPrice
        FROM products
        GROUP BY productLine) AS linePrices
WHERE avgPrice > 50;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

3 rows affected.

+------------------+---------------------+
|   productline    |       avgprice      |
+------------------+---------------------+
|   Classic Cars   | 64.4463157894736842 |
| Trucks and Buses | 56.3290909090909091 |
|   Motorcycles    | 50.6853846153846154 |
+------------------+---------------------+

### 6. List offices with their employee count, showing only offices with more than 2 employees
Use a subquery in FROM clause to count employees per officeCode. Join with offices table to show city, country, and employee count. Filter for offices with more than 2 employees.

In [13]:
%%sql

SELECT o.city, o.country, empCount.numEmployees
FROM offices o
JOIN (SELECT officeCode, COUNT(*) AS numEmployees
    FROM employees
    GROUP BY officeCode) AS empCount 
ON o.officeCode = empCount.officeCode
WHERE empCount.numEmployees > 2;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

3 rows affected.

+---------------+-----------+--------------+
|      city     |  country  | numemployees |
+---------------+-----------+--------------+
| San Francisco |    USA    |      6       |
|     Paris     |   France  |      5       |
|     Sydney    | Australia |      4       |
+---------------+-----------+--------------+

## Part 3: Combining Scalar Subqueries and Derived Tables

### 7. Find customers who ordered products more expensive than the average product price
List DISTINCT customerName for customers whose orders include products with buyPrice > (scalar subquery returning average buyPrice).

**Hint:** Use IN with a subquery that filters products by average price

In [14]:
%%sql

SELECT DISTINCT c.customerName
FROM customers c
WHERE c.customerNumber IN (SELECT o.customerNumber
                            FROM orders o
                            JOIN orderdetails od ON o.orderNumber = od.orderNumber
                            JOIN products p ON od.productCode = p.productCode
                            WHERE p.buyPrice > (SELECT AVG(buyPrice)
                                                    FROM products));

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

98 rows affected.

+------------------------------+
|         customername         |
+------------------------------+
|      Muscle Machine Inc      |
| Mini Gifts Distributors Ltd. |
|   Anna's Decorations, Ltd    |
|       Super Scale Inc.       |
|       Microscale Inc.        |
|              Qu              |
|     L'ordine Souveniers      |
|   Signal Collectibles Ltd.   |
+------------------------------+
Truncated to displaylimit of 8.

### 8. Find employees in offices that have above-average number of employees
Use a subquery in FROM clause to count employees per office. Use another scalar subquery to find average employee count. List firstName, lastName, city for employees in offices with above-average count.

In [15]:
%%sql

SELECT e.firstName, e.lastName, o.city
FROM employees e
JOIN offices o ON e.officeCode = o.officeCode
WHERE e.officeCode IN (SELECT officeCode
                        FROM (SELECT officeCode, COUNT(*) AS empCount
                                FROM employees
                                GROUP BY officeCode) AS officeCounts
                        WHERE empCount > (SELECT AVG(empCount)
                                            FROM (SELECT COUNT(*) AS empCount
                                                    FROM employees
                                                    GROUP BY officeCode) AS avgCalc));

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

15 rows affected.

+-----------+-----------+---------------+
| firstname |  lastname |      city     |
+-----------+-----------+---------------+
|   Leslie  |  Thompson | San Francisco |
|   Leslie  |  Jennings | San Francisco |
|  Anthony  |    Bow    | San Francisco |
|    Jeff   |  Firrelli | San Francisco |
|    Mary   | Patterson | San Francisco |
|   Diane   |   Murphy  | San Francisco |
|   Martin  |   Gerard  |     Paris     |
|   Pamela  |  Castillo |     Paris     |
+-----------+-----------+---------------+
Truncated to displaylimit of 8.

## Part 4: Advanced Comparisons

### 9. Compare each product line's average price to the overall average
Create a derived table showing productLine and its AVG(buyPrice). Select productLine, avgPrice, and show whether it's above or below the overall average (use a scalar subquery for comparison).

**Hint:** Use CASE WHEN in the SELECT with scalar subquery

**Example CASE WHEN syntax:**
```sql
SELECT CASE
    WHEN -1 > 0
    THEN 'more'
    ELSE 'less than'
END AS RESULT
```

In [16]:
%%sql

SELECT productLine, avgPrice, CASE
WHEN avgPrice > (SELECT AVG(buyPrice) 
                    FROM products)
THEN 'Above Average' ELSE 'Below Average' END AS priceCategory
FROM (SELECT productLine, AVG(buyPrice) AS avgPrice
        FROM products
        GROUP BY productLine) AS linePrices;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

7 rows affected.

+------------------+---------------------+---------------+
|   productline    |       avgprice      | pricecategory |
+------------------+---------------------+---------------+
|   Classic Cars   | 64.4463157894736842 | Above Average |
|      Trains      | 43.9233333333333333 | Below Average |
|      Planes      | 49.6291666666666667 | Below Average |
| Trucks and Buses | 56.3290909090909091 | Above Average |
|   Vintage Cars   | 46.0662500000000000 | Below Average |
|   Motorcycles    | 50.6853846153846154 | Below Average |
|      Ships       | 47.0077777777777778 | Below Average |
+------------------+---------------------+---------------+

### 10. Find customers whose number of orders is in the top 25% of all customers
Use a subquery in FROM clause to count orders per customer. Use a scalar subquery to find the 75th percentile of order counts. List customerName and orderCount for customers >= this threshold.

**Hint:** Use PERCENTILE or calculate with LIMIT and OFFSET

In [17]:
%%sql

SELECT c.customerName, orderCounts.numOrders
FROM customers c
JOIN (SELECT customerNumber, COUNT(*) AS numOrders
        FROM orders
        GROUP BY customerNumber) AS orderCounts 
ON c.customerNumber = orderCounts.customerNumber
WHERE orderCounts.numOrders >= (SELECT numOrders
                                FROM (SELECT COUNT(*) AS numOrders
                                        FROM orders
                                        GROUP BY customerNumber
                                        ORDER BY numOrders DESC
                                        LIMIT 1 OFFSET (SELECT (COUNT(DISTINCT customerNumber) * 0.25)::INT
                                        FROM orders)) AS threshold)
ORDER BY orderCounts.numOrders DESC;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

67 rows affected.

+------------------------------+-----------+
|         customername         | numorders |
+------------------------------+-----------+
|    Euro+ Shopping Channel    |     26    |
| Mini Gifts Distributors Ltd. |     17    |
|  Australian Collectors, Co.  |     5     |
|  Down Under Souveniers, Inc  |     5     |
|   Danish Wholesale Imports   |     5     |
|   Dragon Souveniers, Ltd.    |     5     |
|      Reims Collectables      |     5     |
|     Technics Stores Inc.     |     4     |
+------------------------------+-----------+
Truncated to displaylimit of 8.